Merge pull request #10 from vidya-hub/flutter_stream_fixes
Flutter stream fixes
